# 1. 用while语句实现打印三角形，输入一个整数，表示三角形的宽度和高度，打印出相应的三角形;
#  如:
#   请输入三角形宽度: 4
#   打印结果如下:
#   *
#   **
#   ***
#   ****
#   2. 再打印:
#      *
#     **
#    ***
#   ****
#   3. 再打印:
#   ****
#    ***
#     **
#      *
#   4. 再打印:
#   ****
#   ***
#   **
#   *

n = int(input("enter a num: "))
i = 1
while i <= n:
    print('*' * i)
    i += 1

i = 1
while i <= n:
    print(' ' * (n - i) + i * '*')
    i += 1

i = 0
while i < n:
    print(' ' * i + (n - i) * '*')
    i += 1

i = 0
while i < n:
    print((n - i) * '*' + ' ' * i)
    i += 1
# 或者
# i = n
# while i > 0:
#     print('*' * i)
#     i -= 1
